app/controllers/databases_controller.rb

  def show
  	@instance = Instance.find params[:instance_id]
---
SELECT * FROM "instances" WHERE ("instances"."id" = 2) ORDER BY hostname

  def destroy
    @instance = Instance.find params[:instance_id]
---
SELECT * FROM "instances" WHERE ("instances"."id" = 2) ORDER BY hostname