app/controllers/instances_controller.rb

  def index
    @instances = Instance.all
---
SELECT * FROM "instances" ORDER BY hostname

  def show
    @instance = Instance.find(params[:id])
---
SELECT * FROM "instances" WHERE ("instances"."id" = 2) ORDER BY hostname DESC

  def edit
    @instance = Instance.find(params[:id])
---
SELECT * FROM "instances" WHERE ("instances"."id" = 2) ORDER BY hostname

  def create
    @instance = Instance.new(params[:instance])
	if @instance.save
---
INSERT INTO "instances" ("updated_at", "query_port", "index_port", "hostname", "created_at") VALUES('2009-08-01 08:29:31', 9000, 9001, 'dev-aut2.nl.informatm.com', '2009-08-01 08:29:31')

  def update
    @instance = Instance.find(params[:id])
    if @instance.update_attributes(params[:instance])
---
SELECT * FROM "instances" WHERE ("instances"."id" = 1)
UPDATE "instances" SET "index_port" = 9001, "query_port" = 9000, "hostname" = 'stage-aut1.nl.informatm.com', "updated_at" = '2009-08-02 08:03:50' WHERE "id" = 1